vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/fuses.h
/*
 * Component description for FUSES
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_FUSES_COMPONENT_H_
#define _PIC32CMPL10_FUSES_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR FUSES                      */
/* ************************************************************************** */

/* -------- FUSES_SEQNUM : (FUSES Offset: 0x00) (R/W 32) Sequence Number Fuse -------- */
#define FUSES_SEQNUM_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_SEQNUM) Sequence Number Fuse  Reset Value */

#define FUSES_SEQNUM_SEQNUM_Pos               _UINT32_(0)                                          /* (FUSES_SEQNUM) Sequence Number Position */
#define FUSES_SEQNUM_SEQNUM_Msk               (_UINT32_(0xFFFFFFFF) << FUSES_SEQNUM_SEQNUM_Pos)    /* (FUSES_SEQNUM) Sequence Number Mask */
#define FUSES_SEQNUM_SEQNUM(value)            (FUSES_SEQNUM_SEQNUM_Msk & (_UINT32_(value) << FUSES_SEQNUM_SEQNUM_Pos)) /* Assignment of value for SEQNUM in the FUSES_SEQNUM register */
#define FUSES_SEQNUM_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (FUSES_SEQNUM) Register Mask  */


/* -------- FUSES_BOOTPROT : (FUSES Offset: 0x08) (R/W 32) Boot Protection Fuse -------- */
#define FUSES_BOOTPROT_RESETVALUE             _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOOTPROT) Boot Protection Fuse  Reset Value */

#define FUSES_BOOTPROT_BOOTPROT_Pos           _UINT32_(0)                                          /* (FUSES_BOOTPROT) Boot Protection Position */
#define FUSES_BOOTPROT_BOOTPROT_Msk           (_UINT32_(0x7) << FUSES_BOOTPROT_BOOTPROT_Pos)       /* (FUSES_BOOTPROT) Boot Protection Mask */
#define FUSES_BOOTPROT_BOOTPROT(value)        (FUSES_BOOTPROT_BOOTPROT_Msk & (_UINT32_(value) << FUSES_BOOTPROT_BOOTPROT_Pos)) /* Assignment of value for BOOTPROT in the FUSES_BOOTPROT register */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_32768BYTES_Val _UINT32_(0x0)                                        /* (FUSES_BOOTPROT) 32768 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_16384BYTES_Val _UINT32_(0x1)                                        /* (FUSES_BOOTPROT) 16384 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_8192BYTES_Val _UINT32_(0x2)                                        /* (FUSES_BOOTPROT) 8192 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_4096BYTES_Val _UINT32_(0x3)                                        /* (FUSES_BOOTPROT) 4096 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_2048BYTES_Val _UINT32_(0x4)                                        /* (FUSES_BOOTPROT) 2048 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_1024BYTES_Val _UINT32_(0x5)                                        /* (FUSES_BOOTPROT) 1024 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_512BYTES_Val _UINT32_(0x6)                                        /* (FUSES_BOOTPROT) 512 bytes are protected.  */
#define   FUSES_BOOTPROT_BOOTPROT_SIZE_0BYTES_Val _UINT32_(0x7)                                        /* (FUSES_BOOTPROT) 0 bytes are protected.  */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_32768BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_32768BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 32768 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_16384BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_16384BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 16384 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_8192BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_8192BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 8192 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_4096BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_4096BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 4096 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_2048BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_2048BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 2048 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_1024BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_1024BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 1024 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_512BYTES (FUSES_BOOTPROT_BOOTPROT_SIZE_512BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 512 bytes are protected. Position */
#define FUSES_BOOTPROT_BOOTPROT_SIZE_0BYTES   (FUSES_BOOTPROT_BOOTPROT_SIZE_0BYTES_Val << FUSES_BOOTPROT_BOOTPROT_Pos) /* (FUSES_BOOTPROT) 0 bytes are protected. Position */
#define FUSES_BOOTPROT_Msk                    _UINT32_(0x00000007)                                 /* (FUSES_BOOTPROT) Register Mask  */


/* -------- FUSES_WDTCFG : (FUSES Offset: 0x10) (R/W 32) Watchdog Timer Configuration Fuse -------- */
#define FUSES_WDTCFG_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_WDTCFG) Watchdog Timer Configuration Fuse  Reset Value */

#define FUSES_WDTCFG_ENABLE_Pos               _UINT32_(1)                                          /* (FUSES_WDTCFG) Enable Position */
#define FUSES_WDTCFG_ENABLE_Msk               (_UINT32_(0x1) << FUSES_WDTCFG_ENABLE_Pos)           /* (FUSES_WDTCFG) Enable Mask */
#define FUSES_WDTCFG_ENABLE(value)            (FUSES_WDTCFG_ENABLE_Msk & (_UINT32_(value) << FUSES_WDTCFG_ENABLE_Pos)) /* Assignment of value for ENABLE in the FUSES_WDTCFG register */
#define FUSES_WDTCFG_WEN_Pos                  _UINT32_(2)                                          /* (FUSES_WDTCFG) Window Mode Enable Position */
#define FUSES_WDTCFG_WEN_Msk                  (_UINT32_(0x1) << FUSES_WDTCFG_WEN_Pos)              /* (FUSES_WDTCFG) Window Mode Enable Mask */
#define FUSES_WDTCFG_WEN(value)               (FUSES_WDTCFG_WEN_Msk & (_UINT32_(value) << FUSES_WDTCFG_WEN_Pos)) /* Assignment of value for WEN in the FUSES_WDTCFG register */
#define FUSES_WDTCFG_ALWAYSON_Pos             _UINT32_(3)                                          /* (FUSES_WDTCFG) Always On Position */
#define FUSES_WDTCFG_ALWAYSON_Msk             (_UINT32_(0x1) << FUSES_WDTCFG_ALWAYSON_Pos)         /* (FUSES_WDTCFG) Always On Mask */
#define FUSES_WDTCFG_ALWAYSON(value)          (FUSES_WDTCFG_ALWAYSON_Msk & (_UINT32_(value) << FUSES_WDTCFG_ALWAYSON_Pos)) /* Assignment of value for ALWAYSON in the FUSES_WDTCFG register */
#define FUSES_WDTCFG_PER_Pos                  _UINT32_(8)                                          /* (FUSES_WDTCFG) Time-Out Period Position */
#define FUSES_WDTCFG_PER_Msk                  (_UINT32_(0xF) << FUSES_WDTCFG_PER_Pos)              /* (FUSES_WDTCFG) Time-Out Period Mask */
#define FUSES_WDTCFG_PER(value)               (FUSES_WDTCFG_PER_Msk & (_UINT32_(value) << FUSES_WDTCFG_PER_Pos)) /* Assignment of value for PER in the FUSES_WDTCFG register */
#define   FUSES_WDTCFG_PER_CYC8_Val           _UINT32_(0x0)                                        /* (FUSES_WDTCFG) 8 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC16_Val          _UINT32_(0x1)                                        /* (FUSES_WDTCFG) 16 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC32_Val          _UINT32_(0x2)                                        /* (FUSES_WDTCFG) 32 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC64_Val          _UINT32_(0x3)                                        /* (FUSES_WDTCFG) 64 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC128_Val         _UINT32_(0x4)                                        /* (FUSES_WDTCFG) 128 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC256_Val         _UINT32_(0x5)                                        /* (FUSES_WDTCFG) 256 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC512_Val         _UINT32_(0x6)                                        /* (FUSES_WDTCFG) 512 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC1024_Val        _UINT32_(0x7)                                        /* (FUSES_WDTCFG) 1024 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC2048_Val        _UINT32_(0x8)                                        /* (FUSES_WDTCFG) 2048 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC4096_Val        _UINT32_(0x9)                                        /* (FUSES_WDTCFG) 4096 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC8192_Val        _UINT32_(0xA)                                        /* (FUSES_WDTCFG) 8192 clock cycles  */
#define   FUSES_WDTCFG_PER_CYC16384_Val       _UINT32_(0xB)                                        /* (FUSES_WDTCFG) 16384 clock cycles  */
#define FUSES_WDTCFG_PER_CYC8                 (FUSES_WDTCFG_PER_CYC8_Val << FUSES_WDTCFG_PER_Pos)  /* (FUSES_WDTCFG) 8 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC16                (FUSES_WDTCFG_PER_CYC16_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 16 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC32                (FUSES_WDTCFG_PER_CYC32_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 32 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC64                (FUSES_WDTCFG_PER_CYC64_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 64 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC128               (FUSES_WDTCFG_PER_CYC128_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 128 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC256               (FUSES_WDTCFG_PER_CYC256_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 256 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC512               (FUSES_WDTCFG_PER_CYC512_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 512 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC1024              (FUSES_WDTCFG_PER_CYC1024_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 1024 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC2048              (FUSES_WDTCFG_PER_CYC2048_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 2048 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC4096              (FUSES_WDTCFG_PER_CYC4096_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 4096 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC8192              (FUSES_WDTCFG_PER_CYC8192_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 8192 clock cycles Position */
#define FUSES_WDTCFG_PER_CYC16384             (FUSES_WDTCFG_PER_CYC16384_Val << FUSES_WDTCFG_PER_Pos) /* (FUSES_WDTCFG) 16384 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_Pos               _UINT32_(12)                                         /* (FUSES_WDTCFG) Window Position */
#define FUSES_WDTCFG_WINDOW_Msk               (_UINT32_(0xF) << FUSES_WDTCFG_WINDOW_Pos)           /* (FUSES_WDTCFG) Window Mask */
#define FUSES_WDTCFG_WINDOW(value)            (FUSES_WDTCFG_WINDOW_Msk & (_UINT32_(value) << FUSES_WDTCFG_WINDOW_Pos)) /* Assignment of value for WINDOW in the FUSES_WDTCFG register */
#define   FUSES_WDTCFG_WINDOW_CYC8_Val        _UINT32_(0x0)                                        /* (FUSES_WDTCFG) 8 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC16_Val       _UINT32_(0x1)                                        /* (FUSES_WDTCFG) 16 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC32_Val       _UINT32_(0x2)                                        /* (FUSES_WDTCFG) 32 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC64_Val       _UINT32_(0x3)                                        /* (FUSES_WDTCFG) 64 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC128_Val      _UINT32_(0x4)                                        /* (FUSES_WDTCFG) 128 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC256_Val      _UINT32_(0x5)                                        /* (FUSES_WDTCFG) 256 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC512_Val      _UINT32_(0x6)                                        /* (FUSES_WDTCFG) 512 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC1024_Val     _UINT32_(0x7)                                        /* (FUSES_WDTCFG) 1024 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC2048_Val     _UINT32_(0x8)                                        /* (FUSES_WDTCFG) 2048 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC4096_Val     _UINT32_(0x9)                                        /* (FUSES_WDTCFG) 4096 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC8192_Val     _UINT32_(0xA)                                        /* (FUSES_WDTCFG) 8192 clock cycles  */
#define   FUSES_WDTCFG_WINDOW_CYC16384_Val    _UINT32_(0xB)                                        /* (FUSES_WDTCFG) 16384 clock cycles  */
#define FUSES_WDTCFG_WINDOW_CYC8              (FUSES_WDTCFG_WINDOW_CYC8_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 8 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC16             (FUSES_WDTCFG_WINDOW_CYC16_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 16 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC32             (FUSES_WDTCFG_WINDOW_CYC32_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 32 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC64             (FUSES_WDTCFG_WINDOW_CYC64_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 64 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC128            (FUSES_WDTCFG_WINDOW_CYC128_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 128 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC256            (FUSES_WDTCFG_WINDOW_CYC256_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 256 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC512            (FUSES_WDTCFG_WINDOW_CYC512_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 512 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC1024           (FUSES_WDTCFG_WINDOW_CYC1024_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 1024 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC2048           (FUSES_WDTCFG_WINDOW_CYC2048_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 2048 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC4096           (FUSES_WDTCFG_WINDOW_CYC4096_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 4096 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC8192           (FUSES_WDTCFG_WINDOW_CYC8192_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 8192 clock cycles Position */
#define FUSES_WDTCFG_WINDOW_CYC16384          (FUSES_WDTCFG_WINDOW_CYC16384_Val << FUSES_WDTCFG_WINDOW_Pos) /* (FUSES_WDTCFG) 16384 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_Pos             _UINT32_(16)                                         /* (FUSES_WDTCFG) Early Warning Interrupt Time Offset Fuse Position */
#define FUSES_WDTCFG_EWOFFSET_Msk             (_UINT32_(0xF) << FUSES_WDTCFG_EWOFFSET_Pos)         /* (FUSES_WDTCFG) Early Warning Interrupt Time Offset Fuse Mask */
#define FUSES_WDTCFG_EWOFFSET(value)          (FUSES_WDTCFG_EWOFFSET_Msk & (_UINT32_(value) << FUSES_WDTCFG_EWOFFSET_Pos)) /* Assignment of value for EWOFFSET in the FUSES_WDTCFG register */
#define   FUSES_WDTCFG_EWOFFSET_CYC8_Val      _UINT32_(0x0)                                        /* (FUSES_WDTCFG) 8 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC16_Val     _UINT32_(0x1)                                        /* (FUSES_WDTCFG) 16 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC32_Val     _UINT32_(0x2)                                        /* (FUSES_WDTCFG) 32 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC64_Val     _UINT32_(0x3)                                        /* (FUSES_WDTCFG) 64 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC128_Val    _UINT32_(0x4)                                        /* (FUSES_WDTCFG) 128 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC256_Val    _UINT32_(0x5)                                        /* (FUSES_WDTCFG) 256 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC512_Val    _UINT32_(0x6)                                        /* (FUSES_WDTCFG) 512 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC1024_Val   _UINT32_(0x7)                                        /* (FUSES_WDTCFG) 1024 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC2048_Val   _UINT32_(0x8)                                        /* (FUSES_WDTCFG) 2048 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC4096_Val   _UINT32_(0x9)                                        /* (FUSES_WDTCFG) 4096 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC8192_Val   _UINT32_(0xA)                                        /* (FUSES_WDTCFG) 8192 clock cycles  */
#define   FUSES_WDTCFG_EWOFFSET_CYC16384_Val  _UINT32_(0xB)                                        /* (FUSES_WDTCFG) 16384 clock cycles  */
#define FUSES_WDTCFG_EWOFFSET_CYC8            (FUSES_WDTCFG_EWOFFSET_CYC8_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 8 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC16           (FUSES_WDTCFG_EWOFFSET_CYC16_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 16 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC32           (FUSES_WDTCFG_EWOFFSET_CYC32_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 32 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC64           (FUSES_WDTCFG_EWOFFSET_CYC64_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 64 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC128          (FUSES_WDTCFG_EWOFFSET_CYC128_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 128 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC256          (FUSES_WDTCFG_EWOFFSET_CYC256_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 256 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC512          (FUSES_WDTCFG_EWOFFSET_CYC512_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 512 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC1024         (FUSES_WDTCFG_EWOFFSET_CYC1024_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 1024 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC2048         (FUSES_WDTCFG_EWOFFSET_CYC2048_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 2048 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC4096         (FUSES_WDTCFG_EWOFFSET_CYC4096_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 4096 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC8192         (FUSES_WDTCFG_EWOFFSET_CYC8192_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 8192 clock cycles Position */
#define FUSES_WDTCFG_EWOFFSET_CYC16384        (FUSES_WDTCFG_EWOFFSET_CYC16384_Val << FUSES_WDTCFG_EWOFFSET_Pos) /* (FUSES_WDTCFG) 16384 clock cycles Position */
#define FUSES_WDTCFG_Msk                      _UINT32_(0x000FFF0E)                                 /* (FUSES_WDTCFG) Register Mask  */


/* -------- FUSES_BODCFG : (FUSES Offset: 0x18) (R/W 32) BOD Configuration Fuse -------- */
#define FUSES_BODCFG_RESETVALUE               _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BODCFG) BOD Configuration Fuse  Reset Value */

