vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/fuses.h
/* -------- FUSES_USERCFG : (FUSES Offset: 0x20) (R/W 32) User Configuration Fuse -------- */
#define FUSES_USERCFG_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_USERCFG) User Configuration Fuse  Reset Value */

#define FUSES_USERCFG_MVIOMODE_Pos            _UINT32_(0)                                          /* (FUSES_USERCFG) MVIO Operation Mode Position */
#define FUSES_USERCFG_MVIOMODE_Msk            (_UINT32_(0x1) << FUSES_USERCFG_MVIOMODE_Pos)        /* (FUSES_USERCFG) MVIO Operation Mode Mask */
#define FUSES_USERCFG_MVIOMODE(value)         (FUSES_USERCFG_MVIOMODE_Msk & (_UINT32_(value) << FUSES_USERCFG_MVIOMODE_Pos)) /* Assignment of value for MVIOMODE in the FUSES_USERCFG register */
#define   FUSES_USERCFG_MVIOMODE_DUAL_Val     _UINT32_(0x0)                                        /* (FUSES_USERCFG) MVIO operating in dual supply mode  */
#define   FUSES_USERCFG_MVIOMODE_SINGLE_Val   _UINT32_(0x1)                                        /* (FUSES_USERCFG) MVIO operating in Single supply mode  */
#define FUSES_USERCFG_MVIOMODE_DUAL           (FUSES_USERCFG_MVIOMODE_DUAL_Val << FUSES_USERCFG_MVIOMODE_Pos) /* (FUSES_USERCFG) MVIO operating in dual supply mode Position */
#define FUSES_USERCFG_MVIOMODE_SINGLE         (FUSES_USERCFG_MVIOMODE_SINGLE_Val << FUSES_USERCFG_MVIOMODE_Pos) /* (FUSES_USERCFG) MVIO operating in Single supply mode Position */
#define FUSES_USERCFG_CRCSEL_Pos              _UINT32_(6)                                          /* (FUSES_USERCFG) CRC Polynomial Selection Position */
#define FUSES_USERCFG_CRCSEL_Msk              (_UINT32_(0x1) << FUSES_USERCFG_CRCSEL_Pos)          /* (FUSES_USERCFG) CRC Polynomial Selection Mask */
#define FUSES_USERCFG_CRCSEL(value)           (FUSES_USERCFG_CRCSEL_Msk & (_UINT32_(value) << FUSES_USERCFG_CRCSEL_Pos)) /* Assignment of value for CRCSEL in the FUSES_USERCFG register */
#define   FUSES_USERCFG_CRCSEL_CRC16_Val      _UINT32_(0x0)                                        /* (FUSES_USERCFG) CRC-16-CCITT  */
#define   FUSES_USERCFG_CRCSEL_CRC32_Val      _UINT32_(0x1)                                        /* (FUSES_USERCFG) CRC-32 (IEEE 802.3)  */
#define FUSES_USERCFG_CRCSEL_CRC16            (FUSES_USERCFG_CRCSEL_CRC16_Val << FUSES_USERCFG_CRCSEL_Pos) /* (FUSES_USERCFG) CRC-16-CCITT Position */
#define FUSES_USERCFG_CRCSEL_CRC32            (FUSES_USERCFG_CRCSEL_CRC32_Val << FUSES_USERCFG_CRCSEL_Pos) /* (FUSES_USERCFG) CRC-32 (IEEE 802.3) Position */
#define FUSES_USERCFG_CRCBOOT_Pos             _UINT32_(7)                                          /* (FUSES_USERCFG) CRC Boot Position */
#define FUSES_USERCFG_CRCBOOT_Msk             (_UINT32_(0x1) << FUSES_USERCFG_CRCBOOT_Pos)         /* (FUSES_USERCFG) CRC Boot Mask */
#define FUSES_USERCFG_CRCBOOT(value)          (FUSES_USERCFG_CRCBOOT_Msk & (_UINT32_(value) << FUSES_USERCFG_CRCBOOT_Pos)) /* Assignment of value for CRCBOOT in the FUSES_USERCFG register */
#define FUSES_USERCFG_SUT_Pos                 _UINT32_(8)                                          /* (FUSES_USERCFG) Start-up Time Position */
#define FUSES_USERCFG_SUT_Msk                 (_UINT32_(0x7) << FUSES_USERCFG_SUT_Pos)             /* (FUSES_USERCFG) Start-up Time Mask */
#define FUSES_USERCFG_SUT(value)              (FUSES_USERCFG_SUT_Msk & (_UINT32_(value) << FUSES_USERCFG_SUT_Pos)) /* Assignment of value for SUT in the FUSES_USERCFG register */
#define   FUSES_USERCFG_SUT_0MS_Val           _UINT32_(0x0)                                        /* (FUSES_USERCFG) 0 ms  */
#define   FUSES_USERCFG_SUT_1MS_Val           _UINT32_(0x1)                                        /* (FUSES_USERCFG) 1 ms  */
#define   FUSES_USERCFG_SUT_2MS_Val           _UINT32_(0x2)                                        /* (FUSES_USERCFG) 2 ms  */
#define   FUSES_USERCFG_SUT_4MS_Val           _UINT32_(0x3)                                        /* (FUSES_USERCFG) 4 ms  */
#define   FUSES_USERCFG_SUT_8MS_Val           _UINT32_(0x4)                                        /* (FUSES_USERCFG) 8 ms  */
#define   FUSES_USERCFG_SUT_16MS_Val          _UINT32_(0x5)                                        /* (FUSES_USERCFG) 16 ms  */
#define   FUSES_USERCFG_SUT_32MS_Val          _UINT32_(0x6)                                        /* (FUSES_USERCFG) 32 ms  */
#define   FUSES_USERCFG_SUT_64MS_Val          _UINT32_(0x7)                                        /* (FUSES_USERCFG) 64 ms  */
#define FUSES_USERCFG_SUT_0MS                 (FUSES_USERCFG_SUT_0MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 0 ms Position */
#define FUSES_USERCFG_SUT_1MS                 (FUSES_USERCFG_SUT_1MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 1 ms Position */
#define FUSES_USERCFG_SUT_2MS                 (FUSES_USERCFG_SUT_2MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 2 ms Position */
#define FUSES_USERCFG_SUT_4MS                 (FUSES_USERCFG_SUT_4MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 4 ms Position */
#define FUSES_USERCFG_SUT_8MS                 (FUSES_USERCFG_SUT_8MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 8 ms Position */
#define FUSES_USERCFG_SUT_16MS                (FUSES_USERCFG_SUT_16MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 16 ms Position */
#define FUSES_USERCFG_SUT_32MS                (FUSES_USERCFG_SUT_32MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 32 ms Position */
#define FUSES_USERCFG_SUT_64MS                (FUSES_USERCFG_SUT_64MS_Val << FUSES_USERCFG_SUT_Pos) /* (FUSES_USERCFG) 64 ms Position */
#define FUSES_USERCFG_Msk                     _UINT32_(0x000007C1)                                 /* (FUSES_USERCFG) Register Mask  */


/* -------- FUSES_BOOT_GPIOSEL : (FUSES Offset: 0x28) (R/W 32) Boot External Notification I/O Pin Fuse -------- */
#define FUSES_BOOT_GPIOSEL_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_BOOT_GPIOSEL) Boot External Notification I/O Pin Fuse  Reset Value */

#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos     _UINT32_(0)                                          /* (FUSES_BOOT_GPIOSEL) GPIO Pin Select for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_Msk     (_UINT32_(0x1F) << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) GPIO Pin Select for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL(value)  (FUSES_BOOT_GPIOSEL_GPIOPINSEL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos)) /* Assignment of value for GPIOPINSEL in the FUSES_BOOT_GPIOSEL register */
#define   FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN00_Val _UINT32_(0x0)                                        /* (FUSES_BOOT_GPIOSEL) Pin 0  */
#define   FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN01_Val _UINT32_(0x1)                                        /* (FUSES_BOOT_GPIOSEL) Pin 1  */
#define   FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN30_Val _UINT32_(0x1E)                                       /* (FUSES_BOOT_GPIOSEL) Pin 30  */
#define   FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN31_Val _UINT32_(0x1F)                                       /* (FUSES_BOOT_GPIOSEL) Pin 31  */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN00   (FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN00_Val << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Pin 0 Position */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN01   (FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN01_Val << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Pin 1 Position */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN30   (FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN30_Val << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Pin 30 Position */
#define FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN31   (FUSES_BOOT_GPIOSEL_GPIOPINSEL_PIN31_Val << FUSES_BOOT_GPIOSEL_GPIOPINSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Pin 31 Position */
#define FUSES_BOOT_GPIOSEL_ENABLE_Pos         _UINT32_(7)                                          /* (FUSES_BOOT_GPIOSEL) Enable Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_ENABLE_Msk         (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_ENABLE_Pos)     /* (FUSES_BOOT_GPIOSEL) Enable Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_ENABLE(value)      (FUSES_BOOT_GPIOSEL_ENABLE_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_ENABLE_Pos)) /* Assignment of value for ENABLE in the FUSES_BOOT_GPIOSEL register */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos    _UINT32_(8)                                          /* (FUSES_BOOT_GPIOSEL) GPIO Port Select for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Msk    (_UINT32_(0xF) << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) GPIO Port Select for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL(value) (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos)) /* Assignment of value for GPIOPORTSEL in the FUSES_BOOT_GPIOSEL register */
#define   FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTA_Val _UINT32_(0x0)                                        /* (FUSES_BOOT_GPIOSEL) Port A  */
#define   FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTB_Val _UINT32_(0x1)                                        /* (FUSES_BOOT_GPIOSEL) Port B  */
#define   FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTC_Val _UINT32_(0x2)                                        /* (FUSES_BOOT_GPIOSEL) Port C  */
#define   FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTD_Val _UINT32_(0x3)                                        /* (FUSES_BOOT_GPIOSEL) Port D  */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTA  (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTA_Val << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Port A Position */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTB  (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTB_Val << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Port B Position */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTC  (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTC_Val << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Port C Position */
#define FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTD  (FUSES_BOOT_GPIOSEL_GPIOPORTSEL_PORTD_Val << FUSES_BOOT_GPIOSEL_GPIOPORTSEL_Pos) /* (FUSES_BOOT_GPIOSEL) Port D Position */
#define FUSES_BOOT_GPIOSEL_POL_Pos            _UINT32_(17)                                         /* (FUSES_BOOT_GPIOSEL) Select Polarity in Normal Drive Mode for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_POL_Msk            (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_POL_Pos)        /* (FUSES_BOOT_GPIOSEL) Select Polarity in Normal Drive Mode for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_POL(value)         (FUSES_BOOT_GPIOSEL_POL_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_POL_Pos)) /* Assignment of value for POL in the FUSES_BOOT_GPIOSEL register */
#define   FUSES_BOOT_GPIOSEL_POL_FALSE_Val    _UINT32_(0x0)                                        /* (FUSES_BOOT_GPIOSEL) The selected fault source is active-high  */
#define   FUSES_BOOT_GPIOSEL_POL_TRUE_Val     _UINT32_(0x1)                                        /* (FUSES_BOOT_GPIOSEL) The selected fault source is active-low  */
#define FUSES_BOOT_GPIOSEL_POL_FALSE          (FUSES_BOOT_GPIOSEL_POL_FALSE_Val << FUSES_BOOT_GPIOSEL_POL_Pos) /* (FUSES_BOOT_GPIOSEL) The selected fault source is active-high Position */
#define FUSES_BOOT_GPIOSEL_POL_TRUE           (FUSES_BOOT_GPIOSEL_POL_TRUE_Val << FUSES_BOOT_GPIOSEL_POL_Pos) /* (FUSES_BOOT_GPIOSEL) The selected fault source is active-low Position */
#define FUSES_BOOT_GPIOSEL_ODRAIN_Pos         _UINT32_(19)                                         /* (FUSES_BOOT_GPIOSEL) Open Drain Control for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_ODRAIN_Msk         (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_ODRAIN_Pos)     /* (FUSES_BOOT_GPIOSEL) Open Drain Control for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_ODRAIN(value)      (FUSES_BOOT_GPIOSEL_ODRAIN_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_ODRAIN_Pos)) /* Assignment of value for ODRAIN in the FUSES_BOOT_GPIOSEL register */
#define   FUSES_BOOT_GPIOSEL_ODRAIN_FALSE_Val _UINT32_(0x0)                                        /* (FUSES_BOOT_GPIOSEL) The selected fault source is open drain drive  */
#define   FUSES_BOOT_GPIOSEL_ODRAIN_TRUE_Val  _UINT32_(0x1)                                        /* (FUSES_BOOT_GPIOSEL) The selected fault source is normal drive  */
#define FUSES_BOOT_GPIOSEL_ODRAIN_FALSE       (FUSES_BOOT_GPIOSEL_ODRAIN_FALSE_Val << FUSES_BOOT_GPIOSEL_ODRAIN_Pos) /* (FUSES_BOOT_GPIOSEL) The selected fault source is open drain drive Position */
#define FUSES_BOOT_GPIOSEL_ODRAIN_TRUE        (FUSES_BOOT_GPIOSEL_ODRAIN_TRUE_Val << FUSES_BOOT_GPIOSEL_ODRAIN_Pos) /* (FUSES_BOOT_GPIOSEL) The selected fault source is normal drive Position */
#define FUSES_BOOT_GPIOSEL_SLEWLIM_Pos        _UINT32_(20)                                         /* (FUSES_BOOT_GPIOSEL) Slew Rate Control for Boot External Notification Signal Position */
#define FUSES_BOOT_GPIOSEL_SLEWLIM_Msk        (_UINT32_(0x1) << FUSES_BOOT_GPIOSEL_SLEWLIM_Pos)    /* (FUSES_BOOT_GPIOSEL) Slew Rate Control for Boot External Notification Signal Mask */
#define FUSES_BOOT_GPIOSEL_SLEWLIM(value)     (FUSES_BOOT_GPIOSEL_SLEWLIM_Msk & (_UINT32_(value) << FUSES_BOOT_GPIOSEL_SLEWLIM_Pos)) /* Assignment of value for SLEWLIM in the FUSES_BOOT_GPIOSEL register */
#define   FUSES_BOOT_GPIOSEL_SLEWLIM_FALSE_Val _UINT32_(0x0)                                        /* (FUSES_BOOT_GPIOSEL) The slew rate is not limited (fast rise/fall time operation)  */
#define   FUSES_BOOT_GPIOSEL_SLEWLIM_TRUE_Val _UINT32_(0x1)                                        /* (FUSES_BOOT_GPIOSEL) The slew rate is limited.  */
#define FUSES_BOOT_GPIOSEL_SLEWLIM_FALSE      (FUSES_BOOT_GPIOSEL_SLEWLIM_FALSE_Val << FUSES_BOOT_GPIOSEL_SLEWLIM_Pos) /* (FUSES_BOOT_GPIOSEL) The slew rate is not limited (fast rise/fall time operation) Position */
#define FUSES_BOOT_GPIOSEL_SLEWLIM_TRUE       (FUSES_BOOT_GPIOSEL_SLEWLIM_TRUE_Val << FUSES_BOOT_GPIOSEL_SLEWLIM_Pos) /* (FUSES_BOOT_GPIOSEL) The slew rate is limited. Position */
#define FUSES_BOOT_GPIOSEL_Msk                _UINT32_(0x001A0F9F)                                 /* (FUSES_BOOT_GPIOSEL) Register Mask  */


