vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/fuses.h
/* -------- FUSES_DAL2 : (FUSES Offset: 0x00) ( R/ 32) Debug Access Level 2 -------- */
#define FUSES_DAL2_RESETVALUE                 _UINT32_(0xFFFFFF55)                                 /*  (FUSES_DAL2) Debug Access Level 2  Reset Value */

#define FUSES_DAL2_DAL2_Pos                   _UINT32_(0)                                          /* (FUSES_DAL2) Debug Access Level 2 Position */
#define FUSES_DAL2_DAL2_Msk                   (_UINT32_(0xFFFFFFFF) << FUSES_DAL2_DAL2_Pos)        /* (FUSES_DAL2) Debug Access Level 2 Mask */
#define FUSES_DAL2_DAL2(value)                (FUSES_DAL2_DAL2_Msk & (_UINT32_(value) << FUSES_DAL2_DAL2_Pos)) /* Assignment of value for DAL2 in the FUSES_DAL2 register */
#define FUSES_DAL2_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FUSES_DAL2) Register Mask  */


/* -------- FUSES_DAL0 : (FUSES Offset: 0x10) ( R/ 32) Debug Access Level 0 -------- */
#define FUSES_DAL0_RESETVALUE                 _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_DAL0) Debug Access Level 0  Reset Value */

#define FUSES_DAL0_DAL0_Pos                   _UINT32_(0)                                          /* (FUSES_DAL0) Debug Access Level 0 Position */
#define FUSES_DAL0_DAL0_Msk                   (_UINT32_(0xFFFFFFFF) << FUSES_DAL0_DAL0_Pos)        /* (FUSES_DAL0) Debug Access Level 0 Mask */
#define FUSES_DAL0_DAL0(value)                (FUSES_DAL0_DAL0_Msk & (_UINT32_(value) << FUSES_DAL0_DAL0_Pos)) /* Assignment of value for DAL0 in the FUSES_DAL0 register */
#define FUSES_DAL0_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (FUSES_DAL0) Register Mask  */


/* -------- FUSES_KEYVAL_CRC : (FUSES Offset: 0x18) ( R/ 32) Key Value for CMD_CRC -------- */
#define FUSES_KEYVAL_CRC_RESETVALUE           _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CRC) Key Value for CMD_CRC  Reset Value */

#define FUSES_KEYVAL_CRC_KEYVAL_Pos           _UINT32_(0)                                          /* (FUSES_KEYVAL_CRC) Key Value for CMD_CRC Position */
#define FUSES_KEYVAL_CRC_KEYVAL_Msk           (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CRC_KEYVAL_Pos) /* (FUSES_KEYVAL_CRC) Key Value for CMD_CRC Mask */
#define FUSES_KEYVAL_CRC_KEYVAL(value)        (FUSES_KEYVAL_CRC_KEYVAL_Msk & (_UINT32_(value) << FUSES_KEYVAL_CRC_KEYVAL_Pos)) /* Assignment of value for KEYVAL in the FUSES_KEYVAL_CRC register */
#define FUSES_KEYVAL_CRC_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CRC) Register Mask  */


/* -------- FUSES_KEYVAL_CE_ALL : (FUSES Offset: 0x20) ( R/ 32) Key Value for CMD_CE_ALL -------- */
#define FUSES_KEYVAL_CE_ALL_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_CE_ALL) Key Value for CMD_CE_ALL  Reset Value */

#define FUSES_KEYVAL_CE_ALL_KEYVAL_Pos        _UINT32_(0)                                          /* (FUSES_KEYVAL_CE_ALL) Key Value for CMD_CE_ALL Position */
#define FUSES_KEYVAL_CE_ALL_KEYVAL_Msk        (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_CE_ALL_KEYVAL_Pos) /* (FUSES_KEYVAL_CE_ALL) Key Value for CMD_CE_ALL Mask */
#define FUSES_KEYVAL_CE_ALL_KEYVAL(value)     (FUSES_KEYVAL_CE_ALL_KEYVAL_Msk & (_UINT32_(value) << FUSES_KEYVAL_CE_ALL_KEYVAL_Pos)) /* Assignment of value for KEYVAL in the FUSES_KEYVAL_CE_ALL register */
#define FUSES_KEYVAL_CE_ALL_Msk               _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_CE_ALL) Register Mask  */


/* -------- FUSES_KEYVAL_SDAL0 : (FUSES Offset: 0x28) ( R/ 32) Key Value for CMD_SDAL0 -------- */
#define FUSES_KEYVAL_SDAL0_RESETVALUE         _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_KEYVAL_SDAL0) Key Value for CMD_SDAL0  Reset Value */

#define FUSES_KEYVAL_SDAL0_KEYVAL_Pos         _UINT32_(0)                                          /* (FUSES_KEYVAL_SDAL0) Key Value for CMD_SDAL0 Position */
#define FUSES_KEYVAL_SDAL0_KEYVAL_Msk         (_UINT32_(0xFFFFFFFF) << FUSES_KEYVAL_SDAL0_KEYVAL_Pos) /* (FUSES_KEYVAL_SDAL0) Key Value for CMD_SDAL0 Mask */
#define FUSES_KEYVAL_SDAL0_KEYVAL(value)      (FUSES_KEYVAL_SDAL0_KEYVAL_Msk & (_UINT32_(value) << FUSES_KEYVAL_SDAL0_KEYVAL_Pos)) /* Assignment of value for KEYVAL in the FUSES_KEYVAL_SDAL0 register */
#define FUSES_KEYVAL_SDAL0_Msk                _UINT32_(0xFFFFFFFF)                                 /* (FUSES_KEYVAL_SDAL0) Register Mask  */


/* -------- FUSES_NVMLOCKREGION : (FUSES Offset: 0x80) ( R/ 32) NVM Region Lock -------- */
#define FUSES_NVMLOCKREGION_RESETVALUE        _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_NVMLOCKREGION) NVM Region Lock  Reset Value */

#define FUSES_NVMLOCKREGION_LOCK_Pos          _UINT32_(0)                                          /* (FUSES_NVMLOCKREGION) NVM Region Lock Bits Position */
#define FUSES_NVMLOCKREGION_LOCK_Msk          (_UINT32_(0xFFFF) << FUSES_NVMLOCKREGION_LOCK_Pos)   /* (FUSES_NVMLOCKREGION) NVM Region Lock Bits Mask */
#define FUSES_NVMLOCKREGION_LOCK(value)       (FUSES_NVMLOCKREGION_LOCK_Msk & (_UINT32_(value) << FUSES_NVMLOCKREGION_LOCK_Pos)) /* Assignment of value for LOCK in the FUSES_NVMLOCKREGION register */
#define FUSES_NVMLOCKREGION_Msk               _UINT32_(0x0000FFFF)                                 /* (FUSES_NVMLOCKREGION) Register Mask  */


/* -------- FUSES_SERNUM0 : (FUSES Offset: 0x20) ( R/ 32) Serial Number 0 -------- */
#define FUSES_SERNUM0_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_SERNUM0) Serial Number 0  Reset Value */

#define FUSES_SERNUM0_SERNUM0_Pos             _UINT32_(0)                                          /* (FUSES_SERNUM0) Serial Number 0 Position */
#define FUSES_SERNUM0_SERNUM0_Msk             (_UINT32_(0xFFFFFFFF) << FUSES_SERNUM0_SERNUM0_Pos)  /* (FUSES_SERNUM0) Serial Number 0 Mask */
#define FUSES_SERNUM0_SERNUM0(value)          (FUSES_SERNUM0_SERNUM0_Msk & (_UINT32_(value) << FUSES_SERNUM0_SERNUM0_Pos)) /* Assignment of value for SERNUM0 in the FUSES_SERNUM0 register */
#define FUSES_SERNUM0_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_SERNUM0) Register Mask  */


/* -------- FUSES_SERNUM1 : (FUSES Offset: 0x28) ( R/ 32) Serial Number 1 -------- */
#define FUSES_SERNUM1_RESETVALUE              _UINT32_(0xFFFFFFFF)                                 /*  (FUSES_SERNUM1) Serial Number 1  Reset Value */

#define FUSES_SERNUM1_SERNUM1_Pos             _UINT32_(0)                                          /* (FUSES_SERNUM1) Serial Number 1 Position */
#define FUSES_SERNUM1_SERNUM1_Msk             (_UINT32_(0xFFFFFFFF) << FUSES_SERNUM1_SERNUM1_Pos)  /* (FUSES_SERNUM1) Serial Number 1 Mask */
#define FUSES_SERNUM1_SERNUM1(value)          (FUSES_SERNUM1_SERNUM1_Msk & (_UINT32_(value) << FUSES_SERNUM1_SERNUM1_Pos)) /* Assignment of value for SERNUM1 in the FUSES_SERNUM1 register */
#define FUSES_SERNUM1_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (FUSES_SERNUM1) Register Mask  */


